In [20]:
import pandas as pd

data = {
    "Department": ["IT","IT", "IT", "IT", "HR", "Finance"],
    "Employee": ["Alice", "Deniel" "Bob", "Charlie", "David", "Eve"],
    "Salary": [50000, 51000, 55000, 60000, 52000, 57000],
}

df = pd.DataFrame(data)
df

  Department Employee  Salary
0         IT    Alice   50000
1         IT      Bob   55000
2         IT  Charlie   60000
3         HR    David   52000
4    Finance      Eve   57000

In [31]:
grouped = df.groupby('Department')

print(grouped.groups)
print(grouped)

{'Finance': [4], 'HR': [3], 'IT': [0, 1, 2]}
<pandas.core.groupby.generic.DataFrameGroupBy object at 0x123c69f10>

In [22]:
average_salaries = grouped['Salary'].mean()

print(average_salaries)

Department
Finance    57000.0
HR         52000.0
IT         55000.0
Name: Salary, dtype: float64

In [23]:
data['Experience'] = [1,1, 3, 3, 3, 4]
df = pd.DataFrame(data)
df

  Department Employee  Salary  Experience
0         IT    Alice   50000           1
1         IT      Bob   55000           3
2         IT  Charlie   60000           3
3         HR    David   52000           3
4    Finance      Eve   57000           4

In [28]:
multi_grouped = df.groupby(['Department', 'Experience'])

print(multi_grouped.groups)

{('Finance', 4): [4], ('HR', 3): [3], ('IT', 1): [0], ('IT', 3): [1, 2]}

In [30]:
average_salaries_for_IT_3years_experience = multi_grouped['Salary'].mean()
print(average_salaries_for_IT_3years_experience)

Department  Experience
Finance     4             57000.0
HR          3             52000.0
IT          1             50000.0
            3             57500.0
Name: Salary, dtype: float64